#Дана дата в формате dd.mm.yyyy, например: 02.11.2013. 
# Ваша задача — вывести дату в текстовом виде, например: второе ноября 2013 года. 
# Склонением пренебречь (2000 года, 2010 года)

from datetime import date


date = '01.01.2014'

d, m, y = date.split('.')

month = {
    '01' : 'января',
    '11' : 'ноября'
}
days = {
    '01':'первое',
    '02':'второе'
}
result = f'{days[d]} {month[m]} {y} года.'
print(result)